In [1]:
import pandas as pd
print(pd.__version__)

2.3.3

In [2]:
# Cargar el archivo
df = pd.read_csv('personas.csv', sep=';')

#ver las primeras filas
print(df.head())

   Nombre  Edad     Ciudad  Unnamed: 3
0    Juan    26     Ibague         NaN
1   Pedro    56  Monterrey         NaN
2  Camilo    15     Bogota         NaN

In [3]:
df.head()

   Nombre  Edad     Ciudad  Unnamed: 3
0    Juan    26     Ibague         NaN
1   Pedro    56  Monterrey         NaN
2  Camilo    15     Bogota         NaN

In [4]:
#Filtrar personas mayores de 25 aÃ±os
mayores = df[df['Edad']>25]
mayores

  Nombre  Edad     Ciudad  Unnamed: 3
0   Juan    26     Ibague         NaN
1  Pedro    56  Monterrey         NaN

In [5]:
#Calcular edad promedio
promedio = df['Edad'].mean()
print(f"Edad promedio: {promedio}")

Edad promedio: 32.333333333333336

In [6]:
df_limpio = df.drop("Unnamed: 3", axis=1)
df_limpio

   Nombre  Edad     Ciudad
0    Juan    26     Ibague
1   Pedro    56  Monterrey
2  Camilo    15     Bogota